In [2]:
# Import libraries 
import pandas as pd 
import numpy as np
import os

In [199]:
# Import of the data sets "orders" and "products"

In [6]:
# data set path
path = r"/Users/martin/anaconda_projects/11-02-2025 Instacart Basket Analysis"

In [26]:
# "orders" data set
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)

In [13]:
# "products" data set
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

# Dropping Columns

In [28]:
# Using the value_counts() function on the "days_since_prior_order" columns in your df_ords dataframe.
df_ords["days_since_prior_order"].value_counts(dropna=False) # note: Use [] and not () for "days_since_prior_order"!

days_since_prior_order
30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: count, dtype: int64

# Renaming Columns

In [30]:
# To change the name of a column, use the df.rename() function, which takes the following syntax:
# df.rename(columns = {'old_name' : 'new_name'}, inplace = True)
df_ords.rename(columns = {'order_dow' : 'orders_day_of_week'}, inplace = True)

In [32]:
# Check whether the code was executed successfully by running the df_ords.head() function
df_ords.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

# Changing a Variable’s Data Type

In [48]:
# The describe() function is great for getting a lot of statistics—fast!
df.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [58]:
# this functions changes the data type from "order_id" to a string (text) data type
df_ords['order_id'] = df_ords['order_id'].astype('str')

In [56]:
# testing it
df_ords['order_id'].dtype

dtype('O')

# Transposing Data

In [61]:
# Import of the new data set

In [65]:
# "departmens" data set
df_dep = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'departments.csv'), index_col = False)

In [71]:
#  take a glance at the new "departments" data using the head() function:
df_dep.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [75]:
#  the T function switches the rows and columns
df_dep.T

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [77]:
# The result is only visual right now, like a calculator.

In [81]:
# let’s try creating a new dataframe from the transposed version and call it df_dep_t:
df_dep_t = df_dep.T

In [85]:
# check the new created dataframe
df_dep_t

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [ ]:
# note that something strange is going on with the header and first row

In [89]:
# By adding a indext you get rid of the “0” and turn the first row of your dataframe into your headers!
df_dep_t.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [95]:
# Let’s create a new header for your dataframe. This will be done in three steps: 
# 1) Create a new header; 
# 2) Remove the first row in the dataframe; 
# 3) Add the new header.

In [103]:
# 1) Start by creating an object that contains the first row of the dataframe, row 0, using the following command:
new_header = df_dep_t.iloc[0]

In [107]:
# Check out the new header
new_header

0    department
Name: department_id, dtype: object

In [109]:
# Now that you’ve made a copy of your first row, you need to delete it

In [115]:
# Take the data under the header row for a new df
df_dep_t_new = df_dep_t[1:]

In [117]:
# Checking the reult
df_dep_t_new

                  0
1            frozen
2             other
3            bakery
4           produce
5           alcohol
6     international
7         beverages
8              pets
9   dry goods pasta
10             bulk
11    personal care
12     meat seafood
13           pantry
14        breakfast
15     canned goods
16       dairy eggs
17        household
18           babies
19           snacks
20             deli
21          missing

In [125]:
# Tell Python to use the list of column names in your new_header variable as your new header

In [121]:
df_dep_t_new.columns = new_header # Set the header row as the df header

In [138]:
# Check the result
df_dep_t_new

department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

# Data dictonary

In [149]:
# First, use the following command, which will turn your df_dep_t_new dataframe into a dictionary:

In [151]:
data_dict = df_dep_t_new.to_dict('index')

In [153]:
# checking the results
data_dict

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

In [159]:
# Go ahead and use the head() function on your df_prods (products) dataframe to see the first five entries again.
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [161]:
# Row 0 has a "department_id" of 19. You can use your data dictionary to determine what this stands for with the following command:
print(data_dict.get('19'))

{'department': 'snacks'}

# Subsetting

In [166]:
# Create a subset for your df_prods dataframe that only contains data from the snacks department. 
# One way to do so would be by way of the following command:
df_snacks =  df_prods[df_prods['department_id']==19]

## This process can be a bit difficult to comprehend all at once, so let’s try to make sense of it by executing it in parts.

In [170]:
# 1) Start by running the following code, which is just the right side of the command given above (the indexing code itself):
df_prods['department_id']==19

0         True
1        False
2        False
3        False
4        False
         ...
49688    False
49689    False
49690    False
49691    False
49692    False
Name: department_id, Length: 49693, dtype: bool

In [172]:
# 2) Now, let’s run this same indexing code again, only this time, wrapped within another instance of df_prods[]:
df_prods[df_prods["department_id"]==19]

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
15,16,Mint Chocolate Flavored Syrup,103,19,5.2
24,25,Salted Caramel Lean Protein & Fiber Bar,3,19,1.9
31,32,Nacho Cheese White Bean Chips,107,19,4.9
40,41,Organic Sourdough Einkorn Crackers Rosemary,78,19,6.5
...,...,...,...,...,...
49666,49662,Bacon Cheddar Pretzel Pieces,107,19,3.6
49669,49665,Super Dark Coconut Ash & Banana Chocolate Bar,45,19,6.9
49670,49666,Ginger Snaps Snacking Cookies,61,19,5.2
49675,49671,Milk Chocolate Drops,45,19,3.0
49683,49679,Famous Chocolate Wafers,61,19,6.0

In [174]:
# Brilliant! Save these results into a new dataframe. Let’s call it df_snacks The full command, then, is:
df_snacks =  df_prods[df_prods['department_id']==19]

In [176]:
df_snacks.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
15,16,Mint Chocolate Flavored Syrup,103,19,5.2
24,25,Salted Caramel Lean Protein & Fiber Bar,3,19,1.9
31,32,Nacho Cheese White Bean Chips,107,19,4.9
40,41,Organic Sourdough Einkorn Crackers Rosemary,78,19,6.5

In [178]:
# There’s a second way of achieving these same results that you might find a bit simpler!

In [180]:
# In your case, you want this function to look for instances where the value of "department_id" is 19 within the df_prods database:
df_snacks_2 = df_prods.loc[df_prods['department_id'] == 19]

In [182]:
# You could also use the command:

In [186]:
# In this third version, rather than using an equals sign, you’re telling the loc function to look into a list: isin([19])
df_snacks_3 = df_prods.loc[df_prods['department_id'].isin([19])] # you could use more than one value here at the same time (isin([17,18,19])).

# Exporting Dataframes

In [201]:
# The export command takes the following syntax:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_wrangled.csv'))

# Tasks 4.4: Data Wrangling & Subsetting

## Task 2) Adapt data type

In [224]:
# The describe() function is great for getting a lot of statistics—fast!
df.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [212]:
# The user_id is another identifier variable!

In [214]:
# Changing it to a suitable format: 
df_ords['user_id'] = df_ords['user_id'].astype('str')

In [216]:
# testing it
df_ords['order_id'].dtype

dtype('O')

## Task 3) Rename column

In [233]:
# I want to change the name of column days_since_prior_order to: days_po
df_ords.rename(columns={'days_since_prior_order': 'days_po'}, inplace=True)

In [235]:
# Checking the result
df_ords.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_po
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

## Task 4) Data analysis & frequency distributions

In [243]:
# Shows the hour at which most orders are placed.
df_ords['order_hour_of_day'].value_counts()

order_hour_of_day
10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: count, dtype: int64

In [245]:
# Most orders are placed at 10 (288418)!

## Task 5) Create data dictionary

In [256]:
# Allows IDs to be assigned to categories, e.g. ‘department_id’: ‘Snacks’.
data_dict = df_dep_t.to_dict('index')

In [258]:
# Get value from data dictionary
print(data_dict.get('4'))

{0: 'produce'}

In [260]:
# The meaning behind a value of 4 is "produce"!

## Task 6) Filter & subset data

In [268]:
# Creating a subset containing only the breakfast item sales.
df_snacks = df_prods[df_prods['department_id'] == 14]

In [272]:
# Check whether the subset has been created correctly
df_snacks.head()  # Shows the first 5 lines of the subset

,product_id,product_name,aisle_id,department_id,prices
27,28,Wheat Chex Cereal,121,14,10.1
33,34,NaN,121,14,12.2
67,68,"Pancake Mix, Buttermilk",130,14,13.7
89,90,Smorz Cereal,121,14,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,130,14,3.6

In [276]:
print(df_snacks.shape)  # Shows number of rows and columns

(1116, 5)

In [278]:
# There are 1116 rows and 5 columns!

In [280]:
# Verify that only breakfast items are included
print(df_snacks['department_id'].unique())  # Should only output [14]

[14]

## Task 7) Filter & subset data for alcohol, deli, beverages, and meat/seafood

In [319]:
# finding the department_id´s
data_dict

{'department_id': {0: 'department'},
 '1': {0: 'frozen'},
 '2': {0: 'other'},
 '3': {0: 'bakery'},
 '4': {0: 'produce'},
 '5': {0: 'alcohol'},
 '6': {0: 'international'},
 '7': {0: 'beverages'},
 '8': {0: 'pets'},
 '9': {0: 'dry goods pasta'},
 '10': {0: 'bulk'},
 '11': {0: 'personal care'},
 '12': {0: 'meat seafood'},
 '13': {0: 'pantry'},
 '14': {0: 'breakfast'},
 '15': {0: 'canned goods'},
 '16': {0: 'dairy eggs'},
 '17': {0: 'household'},
 '18': {0: 'babies'},
 '19': {0: 'snacks'},
 '20': {0: 'deli'},
 '21': {0: 'missing'}}

In [323]:
# Create a subset with the relevant department_ids
df_dinner_party = df_prods[df_prods['department_id'].isin([ 5, 20, 7, 12])]

In [331]:
# Check the subset
print(df_dinner_party['department_id'].unique())  # Should only output [5, 20, 7, 12]

[ 7 12 20  5]

## Task 8) Gain an overview of data

In [336]:
# To determine the number of rows in your most recently created DataFrame (df_dinner_party)
df_dinner_party.shape

(7650, 5)

In [338]:
# df_dinner_party has 7650 rows and 5 columns!

## Task 9 & 10) Filter & subset data: Finding informations about user_1

In [ ]:
# Before I filter, I check whether user_id is contained in the data at all.

In [370]:
print(df_ords.columns)  # Shows all column names

Index(['order_id', 'user_id', 'eval_set', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_po'],
      dtype='object')

In [391]:
# Result: Yes, user_id is contained in the data!

In [393]:
# Next I check the data type of user_id column:
print(df_ords['user_id'].dtype)  # Is it int or object?

int64

In [395]:
# Result: The data type of user_id = Integer!

In [397]:
# Now I filter all entries for user_id == 1:
df_user_1 = df_ords[df_ords['user_id'] == 1]

In [399]:
# Then I check if the subset contains data:
print(df_user_1.shape)  # Should display the number of rows and columns
df_user_1.head()  # Displays the first lines

(11, 7)

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_po
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [384]:
# Next steps - What can I analyse now?

In [386]:
# When did user_id == 1 place orders?
df_user_1['order_hour_of_day'].value_counts()

order_hour_of_day
8     3
7     3
12    1
15    1
9     1
14    1
16    1
Name: count, dtype: int64

In [401]:
# Result: User_1 placed most order at 8 & 7 (3)!

In [388]:
# On which days of the week did the customer order?
df_user_1['orders_day_of_week'].value_counts()

orders_day_of_week
4    4
1    3
2    2
3    2
Name: count, dtype: int64

In [407]:
# Result: User_1 placed most orderes on 4 (4)!

# Task. 11) Export df_ords dataframe as “orders_wrangled.csv”

In [417]:
# The export command takes the following syntax:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_wrangled.csv'))

# Task. 12) Export the df_dep_t_new dataframe as “departments_wrangled.csv”

In [423]:
# The export command takes the following syntax:
df_dep_t_new.to_csv(os.path.join(path, '02 Data','Prepared Data', 'departments_wrangled.csv'))